In [1]:
import pandas as pd

In [5]:
df_clientes = pd.read_excel('../dataset/caso_estudo.xlsx', sheet_name='clientes')
df_lojas = pd.read_excel('../dataset/caso_estudo.xlsx', sheet_name='lojas')
df_produtos = pd.read_excel('../dataset/caso_estudo.xlsx', sheet_name='produtos')
df_vendas = pd.read_excel('../dataset/caso_estudo.xlsx', sheet_name='vendas')
df_pagamentos = pd.read_excel('../dataset/caso_estudo.xlsx', sheet_name='pagamentos')

# Analise preliminar

In [6]:
df_clientes.sample(5)

      id            nome sexo     dt_nasc
205  206      Caio Pinto    M   4/12/1964
950  951  Aline Oliveira    F   3/14/1959
957  958    Aline Santos    F    7/1/1977
262  263   Tiago Pereira    M  12/14/1968
594  595   Matheus Alves    M   4/14/1972

In [7]:
df_clientes.isnull().sum()

id         0
nome       4
sexo       4
dt_nasc    4
dtype: int64

In [9]:
# Identificando as linhas com algum dado nulo
df_clientes[df_clientes.isnull().T.any()]

      id               nome sexo     dt_nasc
263  264                NaN    F   7/29/1997
264  265                NaN    M    2/7/1979
268  269                NaN    F         NaN
269  270                NaN    M         NaN
276  277      Brenda Santos    F         NaN
282  283      Amanda Barros    F         NaN
287  288     Victor Ribeiro  NaN  12/17/1974
290  291        Clara Pinto  NaN  12/25/1980
294  295         Tiago Lima  NaN   7/26/1973
301  302  Guilherme Cardoso  NaN    3/9/1998

In [10]:
df_clientes.sexo.unique()

array(['F', 'M', nan], dtype=object)

In [11]:
df_lojas

   id          cidade
0   1       São Paulo
1   2  Rio de Janeiro
2   3        Curitiba
3   4  Belo Horizonte
4   5  Santa Catarina
5   6          Recife
6   7        Salvador
7   8        Brasília
8   9          Palmas
9  10         Vitória

In [12]:
df_produtos

   id        produto      valor
0   1          mouse       20.0
1   2        teclado       30.0
2   3  laptop básico     2300.0
3   4   laptop gamer     5300.0
4   5        monitor     1500.0
5   6     impressora      700.0
6   7     carregador      150.0
7   8        cadeira      540.0
8   9           mesa      860.0
9  10       xxx-231a  3211352.0